Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: You can register a custom xref:security-oidc-bearer-token-authentication.adoc#jose4j-validator-bearer[Jose4j Validator] to verify the JWT token content, in addition to the checks described in the <<token-verification>> section above.
ja_jp: 上記の <<token-verification>> セクションで説明したチェックに加えて、JWT トークンの内容を検証するためにカスタムの xref:security-oidc-bearer-token-authentication.adoc#jose4j-validator-bearer[Jose4j Validator] を登録できます。

source: You can register a custom xref:security-oidc-bearer-token-authentication.adoc#jwt-token-certificate-chain[TokenCertificateValidator] to provide inlined certificate chain checks, in addition to the checks described in the <<tokens-with-certificate-chains>> section above.
ja_jp: 上記の <<tokens-with-certificate-chains>> セクションで説明したチェックに加えて、インラインの証明書チェーンチェックを提供するためにカスタムの xref:security-oidc-bearer-token-authentication.adoc#jwt-token-certificate-chain[TokenCertificateValidator] を登録できます。

source: You can register and manage client registrations from the custom xref:security-openid-connect-multitenancy.adoc#tenant-config-resolver[OIDC TenantConfigResolver].
ja_jp: カスタム xref:security-openid-connect-multitenancy.adoc#tenant-config-resolver[OIDC TenantConfigResolver] からクライアント登録を登録・管理することができます。

source: You can register custom codec by providing a CDI _bean_ implementing the `io.quarkus.redis.datasource.codecs.Codec` interface:
ja_jp: `io.quarkus.redis.datasource.codecs.Codec` インタフェースを実装したCDI _bean_ を提供することで、カスタムコーデックを登録できます：

source: You can register new clients on demand. You can add new clients to the existing, already configured `OidcClientConfiguration` or to a newly created `OidcClientConfiguration`.
ja_jp: 必要に応じて新しいクライアントを登録できます。 既存の設定済みの `OidcClientConfiguration` または新しく作成された `OidcClientConfiguration` に新しいクライアントを追加できます。

source: You can register one or more `io.quarkus.oidc.OidcRedirectFilter` implementations to filter OIDC redirects to OIDC authorization and logout endpoints but also local redirects to custom error and session expired pages. Custom `OidcRedirectFilter` can add additional query parameters, response headers and set new cookies.
ja_jp: 1 つ以上の `io.quarkus.oidc.OidcRedirectFilter` 実装を登録して、OIDC 認可およびログアウトエンドポイントへの OIDC リダイレクトだけでなく、カスタムエラーおよびセッション期限切れページへのローカルリダイレクトもフィルタリングできます。カスタム `OidcRedirectFilter` は、さらにクエリーパラメーターおよびレスポンスヘッダーを追加して、新しい Cookie を設定できます。

source: You can register one or more `io.quarkus.oidc.OidcRedirectFilter` implementations to filter OIDC redirects to OIDC authorization and logout endpoints, and also local redirects to custom error and session-expired pages. A custom `OidcRedirectFilter` can add additional query parameters and response headers, and set new cookies.
ja_jp: 1 つ以上の `io.quarkus.oidc.OidcRedirectFilter` 実装を登録して、OIDC 認可およびログアウトエンドポイントへの OIDC リダイレクトだけでなく、カスタムエラーおよびセッション期限切れページへのローカルリダイレクトもフィルタリングできます。 カスタム `OidcRedirectFilter` は、さらにクエリーパラメーターとレスポンスヘッダーを追加して、新しい Cookie を設定できます。

source: You can register the `@ApplicationScoped` bean which will observe important OIDC authentication events. When a user logs in for the first time, re-authenticates, or refreshes the session, the listener is updated. In the future, more events might be reported. For example:
ja_jp: 重要な OIDC 認証イベントを監視する `@ApplicationScoped` Bean を登録できます。 ユーザが初めてログインしたり、再認証したり、セッションをリフレッシュしたりすると、リスナーが更新されます。 将来的には、さらに多くのイベントが報告されるようになるかもしれません。 例:

source: You can register the `@ApplicationScoped` bean, which will observe important OIDC authentication events. When a user logs in for the first time, re-authenticates, or refreshes the session, the listener is updated.
ja_jp: 重要な OIDC 認証イベントを監視する `@ApplicationScoped` Bean を登録できます。 ユーザーが初めてログインしたり、再認証したり、セッションをリフレッシュしたりすると、リスナーが更新されます。

source: You can register xref:security-openid-connect-multitenancy.adoc#tenant-config-resolver[TenantConfigResolver] and build the configuration dynamically, using `OicTenantConfig` builder API, using the request properties such as request path and headers for additional hints or retrieve the matching configuration from the external sources.
ja_jp: xref:security-openid-connect-multitenancy.adoc#tenant-config-resolver[TenantConfigResolver] を登録し、 `OicTenantConfig` ビルダー API を使用して、リクエストパスやヘッダーなどのリクエストプロパティーを追加のヒントとして使用したり、外部ソースから一致する設定を取得したりして、設定を動的に構築できます。

source: You can rely on xref:flyway.adoc[Flyway], xref:liquibase.adoc[Liquibase] or custom setups to create/migrate your database schema, though obviously at a time where the database _is_ accessible -- Flyway's `migrate-at-start` option in particular will just fail at application startup if the database is not reachable.
ja_jp: データベーススキーマの作成やマイグレーションには、 xref:flyway.adoc[Flyway] 、 xref:liquibase.adoc[Liquibase] 、またはカスタムセットアップを利用できますが、当然ながらデータベースにアクセス可能なタイミングで行う必要があります。特に Flyway の `migrate-at-start` オプションは、データベースに到達できない場合、アプリケーションの起動時に失敗します。

source: You can request setting https://developer.mozilla.org/en-US/docs/Web/HTTP/Reference/Headers/Clear-Site-Data[Clear-Site-Data] directives for all of the logout operations with a `quarkus.oidc.logout.clear-site-data` configuration property. For example:
ja_jp: `quarkus.oidc.logout.clear-site-data` 設定プロパティーを使用して、すべてのログアウト操作に対して https://developer.mozilla.org/en-US/docs/Web/HTTP/Reference/Headers/Clear-Site-Data[Clear-Site-Data] ディレクティブの設定をリクエストできます。例:

source: You can request the OpenAPI in JSON format using the `format` query parameter. For example:
ja_jp: OpenAPIをJSON形式でリクエストするには、 `format` クエリパラメータを使用します。例えば、以下のようになります。

source: You can request the token by using the _Copy Login Command_ link in the OpenShift web console.
ja_jp: トークンは、OpenShift ウェブコンソールの _Copy Login Command_ リンクを使用して要求できます。

source: You can request the token via the _Copy Login Command_ link in the OpenShift web console.
ja_jp: トークンは、OpenShiftウェブコンソールの _Copy Login Command_ リンクから要求できます。

source: You can require a fixed port for a database Dev Service using:
ja_jp: Dev Service が使用しているデータベースで固定ポートを要求するには、以下を実行します。

source: You can reserve the domain by using link:https://github.com/quarkiverse/quarkus-ngrok[Quarkiverse ngrok] in dev mode or by reserving it directly in the ngrok dashboard. You cannot use the ngrok domain to test the Quarkus Let's Encrypt ACME feature immediately.
ja_jp: 開発モードで link:https://github.com/quarkiverse/quarkus-ngrok[Quarkiverse ngrok] を使用するか、ngrok ダッシュボードで直接ドメインを予約できます。ngrok ドメインを使用して Quarkus Let's Encrypt ACME 機能をすぐにテストすることはできません。

source: You can resolve this problem by using the following configuration, where `X-ORIGINAL-HOST` is set by Kubernetes Ingress to represent the external endpoint address.:
ja_jp: Kubernetes Ingress によって外部エンドポイントアドレスを表すように `X-ORIGINAL-HOST` が設定されている次の設定を使用することで、この問題を解決できます。

source: You can restore the default behavior of Jackson by setting `quarkus.jackson.fail-on-unknown-properties=true` in your `application.properties` or on a per class basis via `@JsonIgnoreProperties(ignoreUnknown = false)`.
ja_jp: `application.properties` で `quarkus.jackson.fail-on-unknown-properties=true` を設定するか、 `@JsonIgnoreProperties(ignoreUnknown = false)` を経由してクラスごとに設定することで、Jackson のデフォルトの動作を復元することができます。

source: You can restore the default behavior of Jackson by setting `quarkus.jackson.fail-on-unknown-properties=true` in your `application.properties` or on a per-class basis via `@JsonIgnoreProperties(ignoreUnknown = false)`.
ja_jp: `application.properties` で `quarkus.jackson.fail-on-unknown-properties=true` を設定するか、 クラスごとに `@JsonIgnoreProperties(ignoreUnknown = false)` を設定することで、Jackson のデフォルトの動作を復元することができます。

source: You can restrict the Resource methods for which a filter runs, by using link:{jaxrsapi}/jakarta/ws/rs/NameBinding.html[`@NameBinding`] meta-annotations.
ja_jp: link:{jaxrsapi}/jakarta/ws/rs/NameBinding.html[`@NameBinding`] メタアノテーションを使用して、フィルターが実行されるリソースメソッドを制限できます。

source: You can restrict the Resource methods for which a filter runs, by using link:{jaxrsapi}/javax/ws/rs/NameBinding.html[`@NameBinding`] meta-annotations.
ja_jp: link:{jaxrsapi}/javax/ws/rs/NameBinding.html[`@NameBinding`] メタアノテーションを使用して、フィルターが実行されるリソースメソッドを制限できます。

source: You can restrict which content-types your reader/writer apply to by adding link:{jaxrsapi}/jakarta/ws/rs/Consumes.html[`Consumes`]/link:{jaxrsapi}/jakarta/ws/rs/Produces.html[`Produces`] annotations on your provider class.
ja_jp: プロバイダークラスに link:{jaxrsapi}/jakarta/ws/rs/Consumes.html[`Consumes`]/link:{jaxrsapi}/jakarta/ws/rs/Produces.html[`Produces`] アノテーションを追加すると、リーダー/ライターが適用するコンテンツタイプを制限できます。

source: You can restrict which content-types your reader/writer apply to by adding link:{jaxrsapi}/javax/ws/rs/Consumes.html[`Consumes`]/link:{jaxrsapi}/javax/ws/rs/Produces.html[`Produces`] annotations on your provider class.
ja_jp: プロバイダークラスに link:{jaxrsapi}/javax/ws/rs/Consumes.html[`Consumes`]/link:{jaxrsapi}/javax/ws/rs/Produces.html[`Produces`] アノテーションを追加すると、リーダー/ライターが適用するコンテンツタイプを制限することができます。

source: You can retrieve the context from `LiveReloadBuildItem`. This call returns `null` if there is no context for the specified type; otherwise, it returns the stored instance from a previous live reload execution.
ja_jp: `LiveReloadBuildItem` からコンテキストを取得できます。指定されたタイプのコンテキストがない場合、この呼び出しは `null` を返します。それ以外の場合は、以前のライブリロード実行から保存されたインスタンスを返します。

source: You can return _reactive types_ to handle asynchronous processing. Quarkus recommends the usage of https://smallrye.io/smallrye-mutiny[Mutiny] to write reactive and asynchronous code.
ja_jp: 非同期処理を処理するために _リアクティブ型_ を返すことができます。Quarkusでは、リアクティブで非同期なコードを書くために link:https://smallrye.io/smallrye-mutiny[Mutiny] の使用を推奨しています。

source: You can return a `Multi` to produce a JSON Array, where every item is an item from this array. The response is written item by item to the client. To do that set the `produces` attribute to `"application/json"` (or `ReactiveRoutes.APPLICATION_JSON`).
ja_jp: `Multi` を返して、JSON 配列を生成できます。その場合、すべてのアイテムはこの配列のアイテムです。レスポンスは、クライアントに青て、いごとに書き込まれます。これを行うには、 `produces` 属性を `"application/json"` (または `ReactiveRoutes.APPLICATION_JSON`) に設定します。

source: You can return a `Multi` to produce a newline delimited stream of JSON values. To enable this feature, set the `produces` attribute of the `@Route` annotation to `"application/x-ndjson"` (or `ReactiveRoutes.ND_JSON`):
ja_jp: `Multi` を返して、JSON 値の改行区切りストリームを生成できます。この機能を有効にするには、 `@Route` アノテーションの `produces` 属性を `"application/x-ndjson"` (または `ReactiveRoutes.ND_JSON`) に設定します。

source: You can return a `Multi` to produce an event source (stream of server sent events). To enable this feature, set the `produces` attribute to `"text/event-stream"` (or `ReactiveRoutes.EVENT_STREAM`), such as in:
ja_jp: `Multi` を返して、イベントソース (サーバー送信イベントのストリーム) を生成できます。この機能を有効にするには、次のように `produces` 属性を `"text/event-stream"` (または `ReactiveRoutes.EVENT_STREAM`) に設定します。

source: You can return any of the pre-defined types that you can read from the <<resource-types,HTTP response>>, and any other type will be mapped <<json,from that type to JSON>>.
ja_jp: <<resource-types,HTTP response>> から読み取ることができる定義済みのタイプのいずれかを返すことができ、またその他のタイプは <<json,from that type to JSON>> にマップされます。

source: You can return any of the pre-defined types that you can read from the xref:resource-types[HTTP response], and any other type will be mapped xref:json[from that type to JSON].
ja_jp: xref:resource-types[HTTPレスポンス] から読み取れる、あらかじめ定義された任意の型を返すことができ、それ以外の型は、 xref:json[その型からJSON] にマッピングされます。

source: You can return different entity types depending on what happens in your method (a `Legume` or an `Error` for instance).
ja_jp: メソッドで何が起こるかによって異なるエンティティータイプを返すことができます (たとえば `Legume` や `Error`)。

source: You can return instance of `java.lang.Class` here. In such case `CommandLine` will try to instantiate this class using `CommandLine.IFactory`.
ja_jp: ここでは `java.lang.Class` のインスタンスを返すことができます。この場合、 `CommandLine` は `CommandLine.IFactory` を使ってこのクラスのインスタンスを作成しようとします。

source: You can return the tenant id of either `a` or `b` from `io.quarkus.oidc.TenantResolver`:
ja_jp: `io.quarkus.oidc.TenantResolver` から `a` または `b` のテナント ID を返すことができます。

source: You can run the application as a conventional jar file.
ja_jp: 従来の jar ファイルとしてアプリケーションを実行することができます。

source: You can run the application as a standard Java application.
ja_jp: アプリケーションを標準の Java アプリケーションとして実行できます。

source: You can run the application in a container using the JAR produced by the Quarkus Maven Plugin. However, in this section we focus on creating a container image using the produced native executable.
ja_jp: Quarkus Mavenプラグインで生成されたJARを使用して、コンテナー内でアプリケーションを実行することができます。ただし、このセクションでは、生成されたネイティブ実行可能ファイルを使用してコンテナーイメージを作成することに焦点を当てます。

source: You can run the application in a container using the JAR produced by the Quarkus Maven Plugin. However, in this section, we focus on creating a container image using the produced native executable.
ja_jp: Quarkus Maven プラグインによって生成された JAR を使用してコンテナー内でアプリケーションを実行できます。しかし、このセクションでは、生成されたネイティブ実行ファイルを使用したコンテナーイメージの作成に焦点を当てます。

source: You can run the application using: `java -jar build/quarkus-app/quarkus-run.jar`.
ja_jp: アプリケーションは次のようにで実行できます: `java -jar target/quarkus-app/quarkus-run.jar`

source: You can run the application using: `java -jar target/quarkus-app/quarkus-run.jar`
ja_jp: `java -jar target/getting-started-1.0.0-SNAPSHOT-runner.jar` でアプリケーションを実行することができます。

source: You can run the application using: `java -jar target/quarkus-app/quarkus-run.jar`.
ja_jp: アプリケーションを実行するには、次のようにします: `java -jar target/quarkus-app/quarkus-run.jar`

source: You can run the tests against a Keycloak container started in a test mode in a xref:continuous-testing.adoc[Continuous Testing] mode.
ja_jp: テストモードで起動した Keycloak コンテナーに対して、xref:continuous-testing.adoc[継続的テスト] モードでテストを実行できます。

source: You can run these using Maven:
ja_jp: これらは Maven を使って実行することができます。

source: You can scaffold a new Maven project with:
ja_jp: 次のように新しいMavenプロジェクトの枠組を生成することができます。

source: You can secure your Quarkus application endpoints with the built-in HTTP Basic authentication mechanism. For more information, see the following documentation:
ja_jp: 内蔵の HTTP Basic 認証メカニズムを使用して、Quarkus アプリケーションエンドポイントを保護することができます。 詳細については、次のドキュメントを参照してください:

source: You can see all the properties of assistant state https://github.com/quarkusio/quarkus/blob/main/extensions/devui/resources/src/main/resources/dev-ui/state/assistant-state.js[here]
ja_jp: アシスタント状態のすべてのプロパティーは https://github.com/quarkusio/quarkus/blob/main/extensions/devui/resources/src/main/resources/dev-ui/state/assistant-state.js[こちら] で確認できます。

source: You can see all the properties of connection state https://github.com/quarkusio/quarkus/blob/main/extensions/devui/resources/src/main/resources/dev-ui/state/connection-state.js[here]
ja_jp: 接続状態のすべてのプロパティーは https://github.com/quarkusio/quarkus/blob/main/extensions/devui/resources/src/main/resources/dev-ui/state/connection-state.js[こちら] で確認できます。

source: You can see all the properties of dev ui state https://github.com/quarkusio/quarkus/blob/main/extensions/devui/resources/src/main/resources/dev-ui/state/devui-state.js[here]
ja_jp: Dev UI の状態のすべてのプロパティーは https://github.com/quarkusio/quarkus/blob/main/extensions/devui/resources/src/main/resources/dev-ui/state/devui-state.js[こちら] で確認できます。

source: You can see all the properties of theme state https://github.com/quarkusio/quarkus/blob/main/extensions/devui/resources/src/main/resources/dev-ui/state/theme-state.js[here]
ja_jp: テーマ状態のすべてのプロパティーは https://github.com/quarkusio/quarkus/blob/main/extensions/devui/resources/src/main/resources/dev-ui/state/theme-state.js[こちら] で確認できます。

source: You can see how the quickstart has done it within its own link:{quickstarts-tree-url}/funqy-quickstarts/funqy-amazon-lambda-quickstart/src/main/resources/application.properties[application.properties].
ja_jp: クイックスタートがそれをどのように行ったかは、link:{quickstarts-tree-url}/funqy-quickstarts/funqy-amazon-lambda-quickstart/src/main/resources/application.properties[application.properties] で確認できます。

source: You can see how the quickstart has done it within its own {quickstarts-tree-url}/funqy-quickstarts/funqy-amazon-lambda-quickstart/src/main/resources/application.properties[application.properties].
ja_jp: クイックスタートがそれをどのように行ったかは、自身の {quickstarts-tree-url}/funqy-quickstarts/funqy-amazon-lambda-quickstart/src/main/resources/application.properties[application.properties] で確認できます。

source: You can see more information about the bootstrap by enabling additional logging. Simply run the Maven build with `-X` or `--debug` and grep the lines that contain `io.quarkus.arc`. In <<cdi-reference.adoc#dev_mode,dev mode>>, you can use `quarkus.log.category."io.quarkus.arc.processor".level=DEBUG` and two special endpoints are also registered automatically to provide some basic debug info in the JSON format.
ja_jp: 追加のロギングを有効にすることで、ブートストラップに関するより多くの情報を表示できます。そのためには、 `-X` または `--debug` で Maven ビルドを実行し、 `io.quarkus.arc` が含まれる行を grep します。<<cdi-reference.adoc#dev_mode,dev mode>> では、 `quarkus.log.category."io.quarkus.arc.processor".level=DEBUG` を使用でき、2 つの特別なエンドポイントも自動的に登録され、JSON 形式でいくつかの基本的なデバッグ情報が提供されます。

source: You can see more information about the bootstrap by enabling additional logging. Simply run the Maven build with `-X` or `--debug` and grep the lines that contain `io.quarkus.arc`. In the <<cdi-reference.adoc#dev-mode,development mode>>, you can use `quarkus.log.category."io.quarkus.arc.processor".level=DEBUG` and two special endpoints are also registered automatically to provide some basic debug info in the JSON format.
ja_jp: 追加のロギングを有効にすることで、ブートストラップに関するより多くの情報を見ることができます。 `-X` または `--debug` で Maven ビルドを実行し、 `io.quarkus.arc` を含む行を grep するだけです。 link:cdi-reference.html#dev-mode[開発モード] では、 `quarkus.log.category."io.quarkus.arc.processor".level=DEBUG` を使用することができ、2つの特別なエンドポイントも自動的に登録され、JSON形式でいくつかの基本的なデバッグ情報を提供します。

source: You can see more information about the bootstrap by enabling additional logging. Simply run the Maven build with `-X` or `--debug` and grep the lines that contain `io.quarkus.arc`. In the xref:cdi-reference.adoc#dev-mode[development mode], you can use `quarkus.log.category."io.quarkus.arc.processor".level=DEBUG` and two special endpoints are also registered automatically to provide some basic debug info in the JSON format.
ja_jp: 追加のロギングを有効にすることで、ブートストラップに関するより多くの情報を見ることができます。単に `-X` または `--debug` で Maven ビルドを実行し、 `io.quarkus.arc` を含む行を grep してください。 xref:cdi-reference.adoc#dev-mode[開発モード] では、 `quarkus.log.category."io.quarkus.arc.processor".level=DEBUG` と、2つの特別なエンドポイントも自動的に登録され、JSONフォーマットでいくつかの基本的なデバッグ情報を提供することができます。

source: You can see that every time an invocation fails, it's immediately followed by another invocation, until one succeeds. Since we allowed 4 retries, it would require 5 invocations to fail in a row, in order for the user to be actually exposed to a failure. Which is fairly unlikely to happen.
ja_jp: 呼び出しが失敗するたびに、すぐに別の呼び出しが成功するまで続いていることがわかります。4回のリトライを許可しているので、ユーザーが実際に失敗にさらされるためには、5回の呼び出しが連続して失敗する必要があります。これは起こりそうもないことです。

source: You can see that the effect of the tuning was pretty modest, overall. Notice, as well, that there was a bit of a trade-off between throughput and memory footprint; for both frameworks, the tuning optimisations ended up sacrificing some memory to improve speed.
ja_jp: チューニングの効果は、全体的にかなり控えめだったことがわかります。また、スループットとメモリフットプリントの間には多少のトレードオフがあったことにも注目してください。どちらのフレームワークでも、チューニングによる最適化は、速度向上のために一部のメモリを犠牲にすることになりました。

source: You can see the available tags for UBI8 https://quay.io/repository/quarkus/ubi-quarkus-mandrel-builder-image?tab=tags[here] and for UBI9 https://quay.io/repository/quarkus/ubi9-quarkus-mandrel-builder-image?tab=tags[here (UBI 9)])
ja_jp: UBI8で使用可能なタグは link:https://quay.io/repository/quarkus/ubi-quarkus-mandrel-builder-image?tab=tags[こちら] 、UBI9で使用可能なタグは link:https://quay.io/repository/quarkus/ubi9-quarkus-mandrel-builder-image?tab=tags[こちら(UBI 9)] )

source: You can selectively dispatch messages to multiple outgoings by returning `Targeted` from the processing method:
ja_jp: 処理メソッドから `Targeted` を返すことで、メッセージを複数の送信先に選択的にディスパッチできます。

source: You can selectively register `AccessTokenRequestFilter` by using either `io.quarkus.oidc.token.propagation.AccessToken` or `org.eclipse.microprofile.rest.client.annotation.RegisterProvider`, for example:
ja_jp: `io.quarkus.oidc.token.propagation.AccessToken` または `org.eclipse.microprofile.rest.client.annotation.RegisterProvider` のいずれかを使用して、 `AccessTokenRequestFilter` を選択的に登録できます。例:

source: You can selectively register `AccessTokenRequestFilter` by using either `io.quarkus.oidc.token.propagation.common.AccessToken` or `org.eclipse.microprofile.rest.client.annotation.RegisterProvider`, for example:
ja_jp: 例えば、 `io.quarkus.oidc.token.propagation.common.AccessToken` または `org.eclipse.microprofile.rest.client.annotation.RegisterProvider` のどちらかを使用することで、 `AccessTokenRequestFilter` を選択的に登録することができます：

source: You can selectively register `AccessTokenRequestReactiveFilter` by using either `io.quarkus.oidc.token.propagation.AccessToken` or `org.eclipse.microprofile.rest.client.annotation.RegisterProvider` annotation, for example:
ja_jp: `io.quarkus.oidc.token.propagation.AccessToken` または `org.eclipse.microprofile.rest.client.annotation.RegisterProvider` のいずれかを使用して、 `AccessTokenRequestFilter` を選択的に登録できます。例:

source: You can selectively register `AccessTokenRequestReactiveFilter` by using either `io.quarkus.oidc.token.propagation.common.AccessToken` or `org.eclipse.microprofile.rest.client.annotation.RegisterProvider` annotation, for example:
ja_jp: 例えば、 `io.quarkus.oidc.token.propagation.common.AccessToken` または `org.eclipse.microprofile.rest.client.annotation.RegisterProvider` のアノテーションを使用することで、 `AccessTokenRequestReactiveFilter` を選択的に登録することができます：

source: You can selectively register `AccessTokenRequestReactiveFilter` by using either the `io.quarkus.oidc.token.propagation.common.AccessToken` annotation or the `org.eclipse.microprofile.rest.client.annotation.RegisterProvider` annotation, for example:
ja_jp: `io.quarkus.oidc.token.propagation.common.AccessToken` アノテーションまたは `org.eclipse.microprofile.rest.client.annotation.RegisterProvider` アノテーションのいずれかを使用して、 `AccessTokenRequestReactiveFilter` を選択的に登録できます。次に例を示します。

source: You can selectively register `JsonWebTokenRequestFilter` by using either `io.quarkus.oidc.token.propagation.JsonWebToken` or `org.eclipse.microprofile.rest.client.annotation.RegisterProvider`, for example:
ja_jp: たとえば、 `io.quarkus.oidc.token.propagation.JsonWebToken` または `org.eclipse.microprofile.rest.client.annotation.RegisterProvider` を使用して、 `JsonWebTokenRequestFilter` を選択的に登録することが可能です。

source: You can selectively register `OidcClientRequestFilter` by using either `io.quarkus.oidc.client.filter.OidcClientFilter` or `org.eclipse.microprofile.rest.client.annotation.RegisterProvider` annotations:
ja_jp: `io.quarkus.oidc.client.filter.OidcClientFilter` または `org.eclipse.microprofile.rest.client.annotation.RegisterProvider` アノテーションを使用して `OidcClientRequestFilter` を選択的に登録することができます。

source: You can selectively register `OidcClientRequestReactiveFilter` by using either `io.quarkus.oidc.client.reactive.filter.OidcClientFilter` or `org.eclipse.microprofile.rest.client.annotation.RegisterProvider` annotations:
ja_jp: `io.quarkus.oidc.client.reactive.filter.OidcClientFilter` または `org.eclipse.microprofile.rest.client.annotation.RegisterProvider` アノテーションを使用して、 `OidcClientRequestReactiveFilter` を選択的に登録できます。

source: You can selectively register `OidcClientRequestReactiveFilter` by using either io.quarkus.oidc.client.reactive.filter.OidcClientFilter or org.eclipse.microprofile.rest.client.annotation.RegisterProvider annotations:
ja_jp: `io.quarkus.oidc.client.filter.OidcClientFilter` または `org.eclipse.microprofile.rest.client.annotation.RegisterProvider` アノテーションを使用して `OidcClientRequestFilter` を選択的に登録することができます。

source: You can send your logs to Fluentd using a Syslog input. As opposed to the GELF input, the Syslog input will not render multiline logs in one event.
ja_jp: Syslog 入力を使用してログを Fluentd に送信できます。 GELF 入力とは異なり、Syslog 入力では 1 つのイベントで複数行のログがレンダリングされません。
